{
  "sodium.option_impact.low": "Низкое",
  "sodium.option_impact.medium": "Среднее",
  "sodium.option_impact.high": "Высокое",
  "sodium.option_impact.extreme": "Экстремальное",
  "sodium.option_impact.varies": "Варьируется",
  "sodium.options.pages.quality": "Детали",
  "sodium.options.pages.performance": "Производительность",
  "sodium.options.pages.advanced": "Дополнительно",
  "sodium.options.view_distance.tooltip": "Расстояние прорисовки определяет, насколько далеко будет отрисовываться местность. Меньшее расстояние означает, что будет отрисовываться меньше местности, что повышает частоту кадров.",
  "sodium.options.simulation_distance.tooltip": "Расстояние симуляции определяет, на каком расстоянии будут загружаться и обрабатываться местность и сущности. Более короткие расстояния могут снизить нагрузку на внутренний сервер и увеличить частоту кадров.",
  "sodium.options.brightness.tooltip": "Определяет яркость (гамму) игры.",
  "sodium.options.gui_scale.tooltip": "Определяет максимальный коэффициент масштабируемости, который будет использоваться для пользовательского интерфейса. Если используется значение 'авто', то всегда будет использоваться наибольший масштабный коэффициент.",
  "sodium.options.fullscreen.tooltip": "Если эта опция включена, игра будет отображаться в полноэкранном режиме (если поддерживается).",
  "sodium.options.v_sync.tooltip": "Если эта опция включена, частота кадров игры будет синхронизирована с частотой обновления монитора, что обеспечит более плавную работу за счёт общей задержки ввода. Эта настройка может снизить производительность на очень слабых системах.",
  "sodium.options.fps_limit.tooltip": "Ограничивает максимальное количество кадров в секунду. Это поможет снизить расход заряда батареи и общую нагрузку на систему при многозадачной работе. Если включена опция V-Sync, этот параметр будет игнорироваться, если только он не ниже частоты обновления вашего монитора.",
  "sodium.options.view_bobbing.tooltip": "Если эта опция включена, камера игрока будет покачиваться при движении. Игрокам, испытывающим укачивание во время игры, полезно отключить эту опцию.",
  "sodium.options.attack_indicator.tooltip": "Отвечает за положением индикатора атаки на экране.",
  "sodium.options.autosave_indicator.tooltip": "Если эта опция включена, будет показан индикатор, когда игра сохраняет мир на диск.",
  "sodium.options.graphics_quality.tooltip": "Качество графики по умолчанию определяет некоторые унаследованные параметры и необходимо для совместимости с модами. Если опции ниже оставлены \"По умолчанию\", они будут использовать эту настройку.",
  "sodium.options.clouds_quality.tooltip": "Определяет наличие отрисованных облаков на небе.",
  "sodium.options.weather_quality.tooltip": "Определяет качество эффектов дождя и снега.",
  "sodium.options.leaves_quality.name": "Детализация листвы",
  "sodium.options.leaves_quality.tooltip": "Определяет уровень детализации листвы.",
  "sodium.options.particle_quality.name": "Ограничение количества частиц",
  "sodium.options.particle_quality.tooltip": "Определяет максимальное количество частиц, которые могут присутствовать на экране в любой момент времени.",
  "sodium.options.smooth_lighting.tooltip": "Определяет, будут ли блоки плавно освещаться и затеняться. Это немного увеличивает время, необходимое для перерасчёта освещения блока, но не влияет на частоту кадров.",
  "sodium.options.biome_blend.value": "%s блок(а,ов)",
  "sodium.options.biome_blend.tooltip": "Определяет диапазон, в котором биомы будут отобраны для раскрашивания блоков. Более высокие значения значительно увеличивают количество времени, затрачиваемого на создание блоков, что приводит к снижению качества.",
  "sodium.options.entity_distance.tooltip": "Определяет расстояние отрисовки сущностей от игрока. Более высокие значения увеличивают расстояние отрисовки в ущерб частоте кадров.",
  "sodium.options.entity_shadows.tooltip": "Если эта опция включена, под мобами и другими существами будут отрисовываться основные тени.",
  "sodium.options.vignette.name": "Виньетка",
  "sodium.options.vignette.tooltip": "Если эта опция включена, на экране игрока будет отображаться эффект виньетки. Это вряд ли повлияет на частоту кадров, если только вы не ограничены в скорости заполнения.",
  "sodium.options.mipmap_levels.tooltip": "Определяет количество мипмапов, которые будут использоваться для текстур блочной модели. Более высокие значения обеспечивают лучшую визуализацию блоков на расстоянии, но могут негативно повлиять на производительность при использовании большого количества анимированных текстур.",
  "sodium.options.use_block_face_culling.name": "Отбраковка граней блоков",
  "sodium.options.use_block_face_culling.tooltip": "Если эта опция включена, на рендер будут отправляться только те стороны блоков, которые обращены к камере. Это позволяет избавиться от большого количества граней блоков на ранних стадиях процесса отрисовки, экономя пропускную способность памяти и время на ГП. Некоторые пакеты ресурсов могут иметь проблемы с этой опцией, поэтому попробуйте отключить её, если Вы видите дыры в блоках.",
  "sodium.options.use_fog_occlusion.name": "Окклюзия туманом",
  "sodium.options.use_fog_occlusion.tooltip": "Если эта опция включена, то чанки, которые определены как полностью скрытые эффектом тумана, не будут отрисовываться, что способствует повышению производительности. Улучшение может быть более значительным, когда эффекты тумана сильнее (например, под водой), но в некоторых сценариях это может вызвать нежелательные визуальные артефакты между небом и туманом.",
  "sodium.options.use_entity_culling.name": "Отбраковка сущностей",
  "sodium.options.use_entity_culling.tooltip": "Если эта опция включена, сущности, не находящиеся в видимых чанках, будут пропущены во время отрисовки. Это поможет повысить производительность, избегая отрисовки сущностей, расположенных под землёй или за стенами.",
  "sodium.options.use_particle_culling.name": "Отбраковка частиц",
  "sodium.options.use_particle_culling.tooltip": "Если эта опция включена, будут отображаться только те частицы, которые определены как видимые. Это может обеспечить значительное увеличение частоты кадров, когда поблизости находится много частиц.",
  "sodium.options.animate_only_visible_textures.name": "Аним. только видимых текстур",
  "sodium.options.animate_only_visible_textures.tooltip": "Если эта опция включена, будут обновляться только анимированные текстуры, которые определены как видимые. Это может значительно повысить частоту кадров на некоторых аппаратных средствах, особенно при использовании более тяжёлых пакетов ресурсов. Если у вас возникают проблемы с тем, что некоторые текстуры не анимируются, попробуйте отключить этот параметр.",
  "sodium.options.cpu_render_ahead_limit.name": "Предел отрисовки ЦП",
  "sodium.options.cpu_render_ahead_limit.tooltip": "Определяет максимальное количество кадров, в течение которых ЦП может ожидать завершения отрисовки графическим процессором. Очень низкие или высокие значения могут привести к нестабильности частоты кадров.",
  "sodium.options.cpu_render_ahead_limit.value": "%s кадр(а, ов)",
  "sodium.options.allow_direct_memory_access.name": "Прямой доступ к памяти",
  "sodium.options.allow_direct_memory_access.tooltip": "Если опция включена, некоторым критически важным путям кода будет разрешено использовать прямой доступ к памяти для повышения производительности. Это часто значительно снижает нагрузку на процессор при отрисовки чанков и сущностей, но может затруднить диагностику некоторых ошибок и сбоев. Вы должны отключить это только в том случае, если Вас об этом попросили или Вы иным образом знаете, что делаете.",
  "sodium.options.enable_memory_tracing.name": "Трассировка памяти",
  "sodium.options.enable_memory_tracing.tooltip": "Служит для отладки. Если эта опция включена, трассировка стека будет собираться вместе с выделением памяти, что поможет улучшить диагностическую информацию при обнаружении утечек памяти.",
  "sodium.options.performance_impact_string": "Влияние на производительность: %s",
  "sodium.options.use_persistent_mapping.name": "Постоянное текстурирование",
  "sodium.options.use_persistent_mapping.tooltip": "Если эта опция включена, небольшой объём памяти будет постоянно отображаться в качестве буфера ожидания для загрузки чанков, помогая уменьшить нагрузку на процессор и нестабильность времени кадра при загрузке или обновлении чанков.\n\nТребуется OpenGL 4.4 или ARB_buffer_storage.",
  "sodium.options.chunk_memory_allocator.name": "Распределитель памяти",
  "sodium.options.chunk_memory_allocator.tooltip": "Выбирает распределитель памяти, который будет использоваться для отрисовки чанков.\n- ASYNC: Самый быстрый вариант, хорошо работает с большинством современных графических драйверов.\n- SWAP: Запасной вариант для старых графических драйверов. Может значительно увеличить использование памяти.",
  "sodium.options.chunk_update_threads.name": "Потоки обновления чанков",
  "sodium.options.chunk_update_threads.tooltip": "Определяет количество потоков, используемых для построения чанков. Использование большего количества потоков может ускорить загрузку чанков и скорость обновления, но может негативно повлиять на время кадров.",
  "sodium.options.always_defer_chunk_updates.name": "Отложенное обновление чанков",
  "sodium.options.always_defer_chunk_updates.tooltip": "Если эта опция включена, отрисовка никогда не будет ожидать завершения обновления чанков, даже если они важны. Это может значительно повысить частоту кадров в некоторых сценариях, но может создать значительное визуальное отставание в мире.",
  "sodium.options.buttons.undo": "Отмена",
  "sodium.options.buttons.apply": "Применить",
  "sodium.options.buttons.donate": "Угостите нас кофе!"
}
