{
  "sodium.option_impact.low": "Низкая",
  "sodium.option_impact.medium": "Средняя",
  "sodium.option_impact.high": "Высокая",
  "sodium.option_impact.extreme": "Экстремальная",
  "sodium.option_impact.varies": "Вариативная",
  "sodium.options.pages.quality": "Качество",
  "sodium.options.pages.performance": "Производительность",
  "sodium.options.pages.advanced": "Дополнительно",
  "sodium.options.view_distance.tooltip": "Расстояние отрисовки определяет, насколько удаленной будет отрисовываться местность. Более короткие расстояния означают, что будет отображаться меньше рельефа местности, что повышает частоту кадров.",
  "sodium.options.simulation_distance.tooltip": "Расстояние моделирования определяет, насколько удаленная местность и объекты будут загружены и отмечены галочками. Более короткие расстояния могут снизить нагрузку на внутренний сервер и повысить частоту кадров.",
  "sodium.options.brightness.tooltip": "Управляет яркостью (гаммой) игры.",
  "sodium.options.gui_scale.tooltip": "Задает максимальный масштабный коэффициент, который будет использоваться для пользовательского интерфейса. Если используется 'Авто', то всегда будет использоваться наибольший масштабный коэффициент.",
  "sodium.options.fullscreen.tooltip": "Если включено, игра будет отображаться в полноэкранном режиме (если поддерживается).",
  "sodium.options.v_sync.tooltip": "Если эта функция включена, частота кадров в игре будет синхронизирована с частотой обновления монитора, что в целом обеспечивает более плавное воспроизведение за счет общей задержки ввода. Этот параметр может снизить производительность, если ваша система работает слишком медленно.",
  "sodium.options.fps_limit.tooltip": "Ограничивает максимальное количество кадров в секунду. Это может помочь снизить расход батареи и общую нагрузку на систему при многозадачности. Если включена функция V-Sync, эта опция будет игнорироваться, если только она не ниже частоты обновления вашего дисплея.",
  "sodium.options.view_bobbing.tooltip": "Если включено, вид игрока будет раскачиваться и подпрыгивать при перемещении. Игроки, которые испытывают укачивание во время игры, могут извлечь выгоду из отключения этой функции.",
  "sodium.options.attack_indicator.tooltip": "Управляет отображением индикатора атаки на экране.",
  "sodium.options.autosave_indicator.tooltip": "Если включено, будет отображаться индикатор, когда игра сохраняет мир на диск.",
  "sodium.options.graphics_quality.tooltip": "Качество графики по умолчанию управляет некоторыми устаревшими опциями и необходимо для совместимости с модами. Если для приведенных ниже параметров оставить значение 'По умолчанию', они будут использовать этот параметр.",
  "sodium.options.clouds_quality.tooltip": "Управляет качеством отображаемых облаков на небе.",
  "sodium.options.weather_quality.tooltip": "Контролирует качество эффектов дождя и снега.",
  "sodium.options.leaves_quality.name": "Листва",
  "sodium.options.leaves_quality.tooltip": "Контролирует качество листьев.",
  "sodium.options.particle_quality.name": "Качество частиц",
  "sodium.options.particle_quality.tooltip": "Управляет максимальным количеством частиц, которые могут присутствовать на экране в любой момент времени.",
  "sodium.options.smooth_lighting.tooltip": "Управляет тем, будут ли блоки плавно освещаться и затеняться. Это немного увеличивает время, необходимое для восстановления фрагмента, но не влияет на частоту кадров.",
  "sodium.options.biome_blend.value": "%s блок(а,ов)",
  "sodium.options.biome_blend.tooltip": "Управляет диапазоном, из которого будут отбираться биомы для раскрашивания блоков. Более высокие значения значительно увеличивают время, необходимое для создания блоков, что приводит к снижению улучшения качества.",
  "sodium.options.entity_distance.tooltip": "Определяет, на каком расстоянии объекты могут отображаться от игрока. Более высокие значения увеличивают расстояние рендеринга за счет частоты кадров.",
  "sodium.options.entity_shadows.tooltip": "Если включено, базовые тени будут отображаться под мобами и другими объектами.",
  "sodium.options.vignette.name": "Виньетка",
  "sodium.options.vignette.tooltip": "Если включено, эффект виньетки будет отображаться более темную/менее насыщенную область по краям экрана, чтобы игра выглядела более кинематографичной, маловероятно, что это повлияет на частоту кадров, если только у вас не ограничена частота заполнения.",
  "sodium.options.mipmap_levels.tooltip": "Управляет количеством мип-карт, которые будут использоваться для текстур блочной модели. Более высокие значения обеспечивают лучшую визуализацию блоков на расстоянии, но могут отрицательно сказаться на производительности многих анимированных текстур.",
  "sodium.options.use_block_face_culling.name": "Отбраковка граней блоков",
  "sodium.options.use_block_face_culling.tooltip": "Если включено, для рендеринга будут отправлены только те стороны блоков, которые обращены к камере. Это может устранить большое количество граней блоков на самом раннем этапе процесса рендеринга, экономя пропускную способность памяти и время на графическом процессоре. У некоторых пакетов ресурсов могут быть проблемы с этой опцией, поэтому попробуйте отключить ее, если вы видите дыры в блоках.",
  "sodium.options.use_fog_occlusion.name": "Окклюзию туманом",
  "sodium.options.use_fog_occlusion.tooltip": "Если включено, фрагменты, которые, как определено, полностью скрыты эффектами тумана, не будут отображаться, что помогает повысить производительность. Улучшение может быть более значительным, когда эффект тумана сильнее (например, при нахождении под водой), но в некоторых сценариях это может привести к нежелательным визуальным артефактам между небом и туманом.",
  "sodium.options.use_entity_culling.name": "Отбраковка сущностей",
  "sodium.options.use_entity_culling.tooltip": "Если включено, объекты, которые, как определено, не находятся ни в каких видимых фрагментах, будут пропущены во время рендеринга. Это может помочь повысить производительность, избегая рендеринга объектов, расположенных под землей или за стенами.",
  "sodium.options.use_particle_culling.name": "Отбраковка частиц",
  "sodium.options.use_particle_culling.tooltip": "Если включено, будут отображаться только те частицы, которые определены как видимые. Это может обеспечить значительное улучшение частоты кадров, когда поблизости находится много частиц.",
  "sodium.options.animate_only_visible_textures.name": "Аним. только видимые текстуры",
  "sodium.options.animate_only_visible_textures.tooltip": "Если включено, будут обновлены только анимированные текстуры, определенные как видимые. Это может значительно повысить частоту кадров на некоторых аппаратных средствах, особенно с более тяжелыми пакетами ресурсов. Если у вас возникли проблемы с тем, что некоторые текстуры не анимируются, попробуйте отключить эту опцию.",
  "sodium.options.cpu_render_ahead_limit.name": "CPU ограничение",
  "sodium.options.cpu_render_ahead_limit.tooltip": "Указывает максимальное количество кадров, которые центральный процессор может ожидать от графического процессора для завершения рендеринга. Очень низкие или высокие значения могут привести к нестабильности частоты кадров.",
  "sodium.options.cpu_render_ahead_limit.value": "%s кадр(а, ов)",
  "sodium.options.allow_direct_memory_access.name": "Разреш. прямой доступ к памяти",
  "sodium.options.allow_direct_memory_access.tooltip": "Если включено, некоторым критическим путям кода будет разрешено использовать прямой доступ к памяти для повышения производительности. Это часто значительно снижает нагрузку на процессор при рендеринге фрагментов и сущностей, но может затруднить диагностику некоторых ошибок и сбоев. Вы должны отключить это только в том случае, если вас попросили об этом или иным образом знаете, что вы делаете.",
  "sodium.options.enable_memory_tracing.name": "Включить трассировку памяти",
  "sodium.options.enable_memory_tracing.tooltip": "Функция отладки. Если включено, трассировки стека будут собираться вместе с выделением памяти, чтобы помочь улучшить диагностическую информацию при обнаружении утечек памяти.",
  "sodium.options.performance_impact_string": "Влияние на произв-ть: %s",
  "sodium.options.use_persistent_mapping.name": "Постоянное сопоставление",
  "sodium.options.use_persistent_mapping.tooltip": "Если включено, небольшой объем памяти будет постоянно сопоставляться для ускорения обновления фрагментов и рендеринга объектов.\n\nТребуется OpenGL 4.4 или ARB_buffer_storage.",
  "sodium.options.chunk_memory_allocator.name": "Распр. фрагментарной памяти",
  "sodium.options.chunk_memory_allocator.tooltip": "Выбирает распределитель памяти, который будет использоваться для рендеринга фрагментов.\n- ASYNC: самый быстрый вариант, хорошо работает с большинством современных графических драйверов.\n- SWAP: запасной вариант для старых графических драйверов. Может значительно увеличить использование памяти.",
  "sodium.options.chunk_memory_allocator.async": "Async",
  "sodium.options.chunk_memory_allocator.swap": "Swap",
  "sodium.options.chunk_update_threads.name": "Потоки обнов. фрагментов",
  "sodium.options.chunk_update_threads.tooltip": "Указывает количество потоков, которые будут использоваться для построения фрагмента. Использование большего количества потоков может ускорить загрузку фрагментов и скорость обновления, но может негативно повлиять на время обработки кадров.",
  "sodium.options.always_defer_chunk_updates.name": "Откладывание обнов. фрагментов",
  "sodium.options.always_defer_chunk_updates.tooltip": "Если включено, рендеринг никогда не будет ждать завершения обновления фрагмента, даже если они важны. Это может значительно улучшить частоту кадров в некоторых сценариях, но может привести к значительному визуальному запаздыванию в реальном мире.",
  "sodium.options.buttons.undo": "Отменить",
  "sodium.options.buttons.apply": "Применять",
  "sodium.options.buttons.donate": "Купить кофе для JellySquid!"
}
