{
  "sodium.option_impact.low": "Thấp",
  "sodium.option_impact.medium": "Trung Bình",
  "sodium.option_impact.high": "Cao",
  "sodium.option_impact.extreme": "Cực Cao",
  "sodium.option_impact.varies": "Varies",
  "sodium.options.pages.quality": "Chất Lượng",
  "sodium.options.pages.performance": "Hiệu suất",
  "sodium.options.pages.advanced": "Nâng Cao",
  "sodium.options.view_distance.tooltip": "Khoảng cách hiển thị kiểm soát khoảng cách địa hình sẽ được hiển thị. Khoảng cách ngắn hơn có nghĩa là sẽ hiển thị ít địa hình hơn, cải thiện tốc độ khung hình.",
  "sodium.options.simulation_distance.tooltip": "Khoảng cách mô phỏng kiểm soát khoảng cách địa hình và thực thể sẽ được tải và đánh dấu. Khoảng cách ngắn hơn có thể giảm tải cho máy chủ nội bộ và có thể cải thiện tốc độ khung hình.",
  "sodium.options.brightness.tooltip": "Kiểm soát độ sáng (gamma) của trò chơi.",
  "sodium.options.gui_scale.tooltip": "Đặt hệ số tỷ lệ tối đa sẽ được sử dụng cho giao diện người dùng. Nếu 'tự động' được sử dụng, thì hệ số tỷ lệ lớn nhất sẽ luôn được sử dụng.",
  "sodium.options.fullscreen.tooltip": "Nếu được bật, trò chơi sẽ hiển thị ở chế độ toàn màn hình (nếu được hỗ trợ).",
  "sodium.options.v_sync.tooltip": "Nếu được bật, tốc độ khung hình của trò chơi sẽ được đồng bộ hóa với tốc độ làm mới của màn hình, giúp mang lại trải nghiệm mượt mà hơn với chi phí là độ trễ đầu vào tổng thể. Cài đặt này có thể làm giảm hiệu suất nếu hệ thống của bạn quá chậm.",
  "sodium.options.fps_limit.tooltip": "Giới hạn số khung hình tối đa mỗi giây. Điều này có thể giúp giảm mức sử dụng pin và tải chung của hệ thống khi đa tác vụ. Nếu V-Sync được bật, tùy chọn này sẽ bị bỏ qua trừ khi nó thấp hơn tốc độ làm mới màn hình của bạn.",
  "sodium.options.view_bobbing.tooltip": "Nếu được bật, chế độ xem của người chơi sẽ lắc lư và lắc lư khi di chuyển xung quanh. Người chơi bị say tàu xe khi chơi có thể hưởng lợi từ việc tắt tính năng này.",
  "sodium.options.attack_indicator.tooltip": "Kiểm soát vị trí Chỉ số tấn công được hiển thị trên màn hình.",
  "sodium.options.autosave_indicator.tooltip": "Nếu được bật, một chỉ báo sẽ hiển thị khi trò chơi đang lưu thế giới vào đĩa.",
  "sodium.options.graphics_quality.tooltip": "Chất lượng đồ họa mặc định kiểm soát một số tùy chọn cũ và cần thiết để tương thích với mod. Nếu các tùy chọn bên dưới được để \"Mặc định\", chúng sẽ sử dụng cài đặt này.",
  "sodium.options.clouds_quality.tooltip": "Kiểm soát chất lượng của các đám mây được hiển thị trên bầu trời.",
  "sodium.options.weather_quality.tooltip": "Kiểm soát chất lượng của hiệu ứng mưa và tuyết.",
  "sodium.options.leaves_quality.name": "Leaves Quality",
  "sodium.options.leaves_quality.tooltip": "Kiểm soát chất lượng lá.",
  "sodium.options.particle_quality.name": "Particle Quality",
  "sodium.options.particle_quality.tooltip": "Kiểm soát số lượng hạt tối đa có thể xuất hiện trên màn hình bất kỳ lúc nào.",
  "sodium.options.smooth_lighting.tooltip": "Kiểm soát xem các khối có được thắp sáng và đổ bóng mượt mà hay không. Điều này làm tăng một chút thời gian cần thiết để xây dựng lại một đoạn, nhưng không ảnh hưởng đến tốc độ khung hình.",
  "sodium.options.biome_blend.value": "%s block(s)",
  "sodium.options.biome_blend.tooltip": "Kiểm soát phạm vi quần xã sinh vật sẽ được lấy mẫu để tô màu khối. Các giá trị cao hơn làm tăng đáng kể lượng thời gian cần thiết để xây dựng các khối để cải thiện chất lượng giảm dần.",
  "sodium.options.entity_distance.tooltip": "Kiểm soát khoảng cách các thực thể có thể hiển thị từ trình phát. Giá trị cao hơn làm tăng khoảng cách kết xuất với chi phí của tốc độ khung hình.",
  "sodium.options.entity_shadows.tooltip": "Nếu được bật, các bóng cơ bản sẽ được hiển thị bên dưới mob và các thực thể khác.",
  "sodium.options.vignette.name": "Vignette",
  "sodium.options.vignette.tooltip": "Nếu được bật, hiệu ứng họa tiết sẽ được hiển thị trên chế độ xem của trình phát. Điều này rất khó có thể tạo ra sự khác biệt đối với tốc độ khung hình trừ khi bạn bị giới hạn tỷ lệ lấp đầy.",
  "sodium.options.mipmap_levels.tooltip": "Kiểm soát số lượng mipmap sẽ được sử dụng cho kết cấu mô hình khối. Các giá trị cao hơn giúp hiển thị các khối ở khoảng cách xa tốt hơn, nhưng có thể ảnh hưởng xấu đến hiệu suất với nhiều kết cấu động.",
  "sodium.options.use_block_face_culling.name": "Use Block Face Culling",
  "sodium.options.use_block_face_culling.tooltip": "Nếu được bật, chỉ các cạnh của khối đối diện với máy ảnh mới được gửi để hiển thị. Điều này có thể loại bỏ một số lượng lớn các mặt khối từ rất sớm trong quá trình kết xuất, tiết kiệm băng thông bộ nhớ và thời gian trên GPU. Một số gói tài nguyên có thể gặp sự cố với tùy chọn này, vì vậy hãy thử tắt tùy chọn này nếu bạn thấy lỗ hổng trong các khối.",
  "sodium.options.use_fog_occlusion.name": "Use Fog Occlusion",
  "sodium.options.use_fog_occlusion.tooltip": "Nếu được bật, các khối được xác định là bị ẩn hoàn toàn bởi hiệu ứng sương mù sẽ không được hiển thị, giúp cải thiện hiệu suất. Sự cải thiện có thể ấn tượng hơn khi hiệu ứng sương mù nặng hơn (chẳng hạn như khi ở dưới nước), nhưng nó có thể gây ra các tạo tác hình ảnh không mong muốn giữa bầu trời và sương mù trong một số tình huống.",
  "sodium.options.use_entity_culling.name": "Use Entity Culling",
  "sodium.options.use_entity_culling.tooltip": "Nếu được bật, các thực thể được xác định là không nằm trong bất kỳ khối hiển thị nào sẽ bị bỏ qua trong quá trình kết xuất. Điều này có thể giúp cải thiện hiệu suất bằng cách tránh hiển thị các thực thể nằm dưới lòng đất hoặc sau các bức tường.",
  "sodium.options.use_particle_culling.name": "Use Particle Culling",
  "sodium.options.use_particle_culling.tooltip": "Nếu được bật, chỉ các hạt được xác định là hiển thị mới được hiển thị. Điều này có thể cải thiện đáng kể tốc độ khung hình khi có nhiều hạt ở gần.",
  "sodium.options.animate_only_visible_textures.name": "Animate Only Visible Textures",
  "sodium.options.animate_only_visible_textures.tooltip": "Nếu được bật, chỉ những họa tiết động được xác định là hiển thị mới được cập nhật. Điều này có thể giúp tăng đáng kể tốc độ khung hình trên một số phần cứng, đặc biệt là với các gói tài nguyên nặng hơn. Nếu bạn gặp sự cố với một số họa tiết không hoạt ảnh, hãy thử tắt tùy chọn này.",
  "sodium.options.cpu_render_ahead_limit.name": "CPU Render-Ahead Limit",
  "sodium.options.cpu_render_ahead_limit.tooltip": "Chỉ định số lượng khung hình tối đa mà CPU có thể đợi trên GPU để kết thúc kết xuất. Các giá trị rất thấp hoặc cao có thể tạo ra sự không ổn định về tốc độ khung hình.",
  "sodium.options.cpu_render_ahead_limit.value": "%s frame(s)",
  "sodium.options.allow_direct_memory_access.name": "Allow Direct Memory Access",
  "sodium.options.allow_direct_memory_access.tooltip": "Nếu được bật, một số đường dẫn mã quan trọng sẽ được phép sử dụng quyền truy cập bộ nhớ trực tiếp để thực hiện. Điều này thường làm giảm đáng kể chi phí hoạt động của CPU đối với kết xuất khối và thực thể, nhưng có thể khiến việc chẩn đoán một số lỗi và sự cố trở nên khó khăn hơn. Bạn chỉ nên tắt tính năng này nếu bạn được yêu cầu hoặc nếu không thì bạn biết mình đang làm gì.",
  "sodium.options.enable_memory_tracing.name": "Enable Memory Tracing",
  "sodium.options.enable_memory_tracing.tooltip": "Tính năng gỡ lỗi. Nếu được bật, dấu vết ngăn xếp sẽ được thu thập cùng với phân bổ bộ nhớ để giúp cải thiện thông tin chẩn đoán khi phát hiện rò rỉ bộ nhớ.",
  "sodium.options.performance_impact_string": "Tác động đến hiệu suất: %s",
  "sodium.options.use_persistent_mapping.name": "Use Persistent Mapping",
  "sodium.options.use_persistent_mapping.tooltip": "Nếu được bật, một lượng nhỏ bộ nhớ sẽ liên tục được ánh xạ để tăng tốc độ cập nhật đoạn dữ liệu và hiển thị thực thể.\n\nYêu cầu OpenGL 4.4 hoặc ARB_buffer_storage.",
  "sodium.options.chunk_memory_allocator.name": "Chunk Memory Allocator",
  "sodium.options.chunk_memory_allocator.tooltip": "Chọn bộ cấp phát bộ nhớ sẽ được sử dụng để kết xuất khối.\n- ASYNC: Tùy chọn nhanh nhất, hoạt động tốt với hầu hết các trình điều khiển đồ họa hiện đại.\n- SWAP: Tùy chọn dự phòng cho các trình điều khiển đồ họa cũ hơn. Có thể tăng mức sử dụng bộ nhớ đáng kể.",
  "sodium.options.chunk_memory_allocator.async": "Async",
  "sodium.options.chunk_memory_allocator.swap": "Swap",
  "sodium.options.chunk_update_threads.name": "Chunk Update Threads",
  "sodium.options.chunk_update_threads.tooltip": "Chỉ định số lượng chủ đề sẽ sử dụng để xây dựng khối. Sử dụng nhiều luồng hơn có thể tăng tốc độ tải khối và tốc độ cập nhật, nhưng có thể ảnh hưởng tiêu cực đến thời gian khung hình.",
  "sodium.options.always_defer_chunk_updates.name": "Always Defer Chunk Updates",
  "sodium.options.always_defer_chunk_updates.tooltip": "Nếu được bật, kết xuất sẽ không bao giờ đợi các bản cập nhật đoạn kết thúc, ngay cả khi chúng quan trọng. Điều này có thể cải thiện đáng kể tốc độ khung hình trong một số tình huống, nhưng nó có thể tạo ra độ trễ hình ảnh đáng kể trên thế giới.",
  "sodium.options.buttons.undo": "Hoàn tác",
  "sodium.options.buttons.apply": "Áp dụng",
  "sodium.options.buttons.donate": "Mua cà phê cho JellySquid!"
}
